app/controllers/school_classes_controller.rb

    def create

        @school_class = SchoolClass.find_or_create_by(params_restrictions(:title, :room_number))
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "pair project room"], ["room_number", 505], ["created_at", "2020-09-18 13:31:09.179014"], ["updated_at", "2020-09-18 13:31:09.179014"]]
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."title" = ? AND "school_classes"."room_number" = ? LIMIT ?  [["title", "pair project room"], ["room_number", 505], ["LIMIT", 1]]

    def update

        @school_class = SchoolClass.find(params[:id])
        @school_class.update(params_restrictions(:title, :room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 606], ["updated_at", "2020-09-18 13:47:09.116123"], ["id", 4]]