app/controllers/students_controller.rb

    def create

        @student = Student.find_or_create_by(params_restrictions(:first_name, :last_name))
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "wolf"], ["last_name", "hayley"], ["created_at", "2020-09-18 13:45:44.639393"], ["updated_at", "2020-09-18 13:45:44.639393"]]
SELECT  "students".* FROM "students" WHERE "students"."first_name" = ? AND "students"."last_name" = ? LIMIT ?  [["first_name", "wolf"], ["last_name", "hayley"], ["LIMIT", 1]]

    def update

        @student = Student.find(params[:id])
        @student.update(params_restrictions(:first_name, :last_name))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "jim-edited"], ["updated_at", "2020-09-18 13:53:57.147281"], ["id", 8]]